### Terraform Plan Results ✅

#### Validation
- **Format Check:** `failure`
- **Init:** `success`
- **Validate:** `success`
- **Plan:** `Success` (exit code: 0)

#### Changes Summary
- **To Add:** 14
- **To Change:** 56
- **To Destroy:** 0

<details><summary>Show Plan Output</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.alb.aws_lb.main will be updated in-place
  ~ resource "aws_lb" "main" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:116485588224:loadbalancer/app/dals-language-dev-alb/3bee8d9dbe71878c"
        name                                        = "dals-language-dev-alb"
      ~ subnets                                     = [
          - "subnet-02f0986b5463587ba",
          - "subnet-0eccc7a49970cab22",
        ] -> (known after apply)
      ~ tags                                        = {
          ~ "Environment" = "dev" -> "Dev"
            "ManagedBy"   = "Terraform"
            "Name"        = "dals-language-dev-alb"
            "Owner"       = "Enyioman"
            "Project"     = "dals-language"
        }
      ~ tags_all                                    = {
          ~ "Environment" = "dev" -> "Dev"
          + "Service"     = "dals-language"
            # (4 unchanged elements hidden)
        }
        # (22 unchanged attributes hidden)

      - subnet_mapping {
          - subnet_id = "subnet-02f0986b5463587ba" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0eccc7a49970cab22" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # module.alb.aws_lb_listener.http will be updated in-place
  ~ resource "aws_lb_listener" "http" {
        id                                   = "arn:aws:elasticloadbalancing:us-east-1:116485588224:listener/app/dals-language-dev-alb/3bee8d9dbe71878c/3253a43982c96766"
      ~ tags                                 = {
          ~ "Environment" = "dev" -> "Dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "Enyioman"
            "Project"     = "dals-language"
        }
      ~ tags_all                             = {
          ~ "Environment" = "dev" -> "Dev"
          + "Service"     = "dals-language"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.alb.aws_lb_target_group.main will be updated in-place
  ~ resource "aws_lb_target_group" "main" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:116485588224:targetgroup/dals-language-dev-tg/a52ac779905a4006"
        name                               = "dals-language-dev-tg"
      ~ tags                               = {
          ~ "Environment" = "dev" -> "Dev"
            "ManagedBy"   = "Terraform"
            "Name"        = "dals-language-dev-tg"
            "Owner"       = "Enyioman"
            "Project"     = "dals-language"
        }
      ~ tags_all                           = {
          ~ "Environment" = "dev" -> "Dev"
          + "Service"     = "dals-language"
            # (4 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ecs.aws_cloudwatch_log_group.ecs will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "ecs" {
        id                = "/ecs/dals-language-dev-app"
        name              = "/ecs/dals-language-dev-app"
      ~ tags              = {
          ~ "Environment" = "dev" -> "Dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "Enyioman"
            "Project"     = "dals-language"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "Dev"
          + "Service"     = "dals-language"
            # (3 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_cluster.main will be updated in-place
  ~ resource "aws_ecs_cluster" "main" {
        id       = "arn:aws:ecs:us-east-1:116485588224:cluster/dals-language-dev-cluster"
        name     = "dals-language-dev-cluster"
      ~ tags     = {
          ~ "Environment" = "dev" -> "Dev"
            "ManagedBy"   = "Terraform"
            "Name"        = "dals-language-dev-cluster"
            "Owner"       = "Enyioman"
            "Project"     = "dals-language"
        }
      ~ tags_all = {
          ~ "Environment" = "dev" -> "Dev"
          + "Service"     = "dals-language"
            # (4 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:116485588224:service/dals-language-dev-cluster/dals-language-dev-service"
        name                               = "dals-language-dev-service"
      ~ tags                               = {
          ~ "Environment" = "dev" -> "Dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "Enyioman"
            "Project"     = "dals-language"
        }
      ~ tags_all                           = {
          ~ "Environment" = "dev" -> "Dev"
          + "Service"     = "dals-language"
            # (3 unchanged elements hidden)
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:116485588224:task-definition/dals-language-dev-app:1" -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ network_configuration {
          ~ subnets          = [
              - "subnet-0006a0a5339e72aa9",
              - "subnet-0fcb66169d9d0859d",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:116485588224:task-definition/dals-language-dev-app:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:116485588224:task-definition/dals-language-dev-app" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        {
                            name  = "DATABASE_HOST"
                            value = "dals-language-dev-db.cwd0mo8441pt.us-east-1.rds.amazonaws.com:5432"
                        },
                      ~ {
                            name  = "ENVIRONMENT"
                          ~ value = "dev" -> "Dev"
                        },
                        {
                            name  = "REDIS_HOST"
                            value = "dals-language-dev-redis.adbdwo.0001.use1.cache.amazonaws.com"
                        },
                        # (1 unchanged element hidden)
                    ]
                  - mountPoints      = []
                    name             = "app"
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 80
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "dals-language-dev-app" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      ~ tags                     = {
          ~ "Environment" = "dev" -> "Dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "Enyioman"
            "Project"     = "dals-language"
        }
      ~ tags_all                 = {
          ~ "Environment" = "dev" -> "Dev"
          + "Service"     = "dals-language"
            # (3 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role.ecs_task will be updated in-place
  ~ resource "aws_iam_role" "ecs_task" {
        id                    = "dals-language-dev-ecs-task-role"
        name                  = "dals-language-dev-ecs-task-role"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "Dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "Enyioman"
            "Project"     = "dals-language"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "Dev"
          + "Service"     = "dals-language"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_iam_role.ecs_task_execution will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_execution" {
        id                    = "dals-language-dev-ecs-task-execution-role"
        name                  = "dals-language-dev-ecs-task-execution-role"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "Dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "Enyioman"
            "Project"     = "dals-language"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "Dev"
          + "Service"     = "dals-language"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.elasticache.aws_cloudwatch_log_group.redis_engine_log will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "redis_engine_log" {
        id                = "/aws/elasticache/dals-language-dev-redis/engine-log"
        name              = "/aws/elasticache/dals-language-dev-redis/engine-log"
      ~ tags              = {
          ~ "Environment" = "dev" -> "Dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "Enyioman"
            "P
... (truncated)
```

</details>


